In [32]:
import pandas as pd
import numpy as np

In [5]:
# read file and show table's 5 first informations with head 
df = pd.read_excel('data.xlsx')
df.head()

   ClienteID               Cliente Estado Sexo    Status
0          1  Adelina Buenaventura     RJ    M    Silver
1          2          Adelino Gago     RJ    M    Silver
2          3       Adolfo Patrício     PE    M    Silver
3          4      Adriana Guedelha     RO    F  Platinum
4          5         Adélio Lisboa     SE    M    Silver

In [6]:
# information with type, column names and nn value
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ClienteID  250 non-null    int64
 1   Cliente    250 non-null    object
 2   Estado     250 non-null    object
 3   Sexo       250 non-null    object
 4   Status     250 non-null    object
dtypes: int64(1), object(4)
memory usage: 9.9+ KB

In [16]:
# filtering by types
df.select_dtypes(exclude=int)

                  Cliente Estado Sexo    Status
0    Adelina Buenaventura     RJ    M    Silver
1            Adelino Gago     RJ    M    Silver
2         Adolfo Patrício     PE    M    Silver
3        Adriana Guedelha     RO    F  Platinum
4           Adélio Lisboa     SE    M    Silver
..                    ...    ...  ...       ...
245  Jandaíra Albuquerque     SP    F    Silver
246            Joana Ataí     GO    F  Platinum
247       Joaquim Hurtado     AP    M    Silver
248        Joaquim Mieiro     TO    M    Silver
249  Joaquina Vasconcelos     SC    F    Silver

[250 rows x 4 columns]

In [24]:
# lines/columns quantity
df.shape

(250, 5)

In [25]:
# statistics information
df.describe().transpose()

           count   mean        std  min    25%    50%     75%    max
ClienteID  250.0  125.5  72.312977  1.0  63.25  125.5  187.75  250.0

In [26]:
df.index

RangeIndex(start=0, stop=250, step=1)

In [27]:
# selecting columns (need to put on a list)
df.loc[:, 'Sexo']

0      M
1      M
2      M
3      F
4      M
      ..
245    F
246    F
247    M
248    M
249    F
Name: Sexo, Length: 250, dtype: object

In [28]:
# selecting information corresponding to a row with the corresponding column
df.iloc[1:5]

   ClienteID           Cliente Estado Sexo    Status
1          2      Adelino Gago     RJ    M    Silver
2          3   Adolfo Patrício     PE    M    Silver
3          4  Adriana Guedelha     RO    F  Platinum
4          5     Adélio Lisboa     SE    M    Silver

In [40]:
df.query('Sexo == "F"').median

<bound method DataFrame.median of      ClienteID               Cliente Estado Sexo    Status
3            4      Adriana Guedelha     RO    F  Platinum
6            7         Aida Dorneles     RN    F    Silver
11          12       Alceste Varanda     RR    F    Silver
14          15     Alexandra Tabares     MG    F    Silver
19          20        Amélia Estévez     PE    F    Silver
..         ...                   ...    ...  ...       ...
240        241      Irene Villanueva     AC    F    Silver
241        242      Isabel Meirelles     RO    F    Silver
245        246  Jandaíra Albuquerque     SP    F    Silver
246        247            Joana Ataí     GO    F  Platinum
249        250  Joaquina Vasconcelos     SC    F    Silver

[120 rows x 5 columns]>